# frozen_string_literal: true

# taps
tap 'codeclimate/formulae'
tap 'github/gh'
tap 'heroku/brew'
tap 'homebrew/cask-fonts'
tap 'bbc/audiowaveform'
tap 'hashicorp/tap'
tap 'homebrew-ffmpeg/ffmpeg'
tap 'buildpacks/tap'
tap 'jesseduffield/lazydocker'
tap 'jesseduffield/lazygit'

# general tools
brew 'antidote'
brew 'aria2'
brew 'awscli'
brew 'axel'
brew 'bash'
brew 'bat'
brew 'broot'
brew 'cabal-install'
brew 'caddy'
brew 'codeclimate'
brew 'curl'
brew 'diff-so-fancy'
brew 'direnv'
brew 'docker-slim'
brew 'dog'
brew 'duf'
brew 'elixir'
brew 'exa'
brew 'exercism'
brew 'fd'
brew 'fx'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'git-interactive-rebase-tool'
brew 'git-lfs'
brew 'git-trim'
brew 'go'
brew 'haskell-stack'
brew 'helm'
brew 'heroku'
brew 'hugo'
brew 'httpie'
brew 'jless'
brew 'jq'
brew 'kubectl'
brew 'jesseduffield/lazydocker/lazydocker'
brew 'jesseduffield/lazygit/lazygit'
brew 'less'
brew 'lolcat'
brew 'magic-wormhole'
brew 'mas'
brew 'mosh'
brew 'neofetch'
brew 'neovim'
brew 'openssl'
brew 'overmind'
brew 'buildpacks/tap/pack'
# This installs a libpq that may not be compatible with the version of postgres installed after this
# brew 'pgcli'
brew 'plow'
brew 'postgresql@14'
brew 'procs'
brew 'progress'
brew 'pyenv'
brew 'rbenv'
brew 'rclone'
brew 'redis'
brew 'ripgrep'
brew 'scc'
brew 'shellcheck'
brew 'tealdeer' # tldr client
brew 'hashicorp/tap/terraform'
brew 'tailspin'
brew 'tig'
brew 'tokei'
brew 'trash'
brew 'vim'
brew 'wget'
brew 'youtube-dl'
brew 'zoxide'
brew 'zsh'
brew 'zsh-completions'

# audio tools
brew 'audiowaveform' if File.exist?("/usr/bin/clang++") # install via apt on linux
brew 'taglib'
brew 'sox'
brew 'libopenmpt'
brew 'game-music-emu'
brew 'homebrew-ffmpeg/ffmpeg/ffmpeg', args: %w[with-libopenmpt with-game-music-emu]
brew 'libshout'

# casks
cask '1password'
cask 'alfred'
cask 'audacity'
cask 'bartender'
cask 'chromedriver'
cask 'homebrew/cask/dash'
cask 'devutils'
cask 'discord'
cask 'homebrew/cask/docker'
cask 'dropbox'
cask 'homebrew/cask-drivers/elgato-control-center'
# cask 'fig'
cask 'figma'
cask 'firefox'
cask 'fork'
cask 'github'
cask 'google-chrome'
# cask 'google-chrome-canary'
cask 'handbrake'
cask 'hey'
# cask 'homebrew/cask-versions/java8'
cask 'insomnia'
cask 'iterm2'
# cask 'java'
# cask 'karabiner-elements'
cask 'muzzle'
cask 'ngrok'
cask 'numi'
cask 'obsidian'
cask 'ocenaudio'
cask 'omnidisksweeper'
cask 'paw'
cask 'pictogram'
# cask 'pop'
# cask 'postman'
cask 'proxyman'
cask 'session-manager-plugin'
cask 'sequential'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'surfshark'
cask 'tableplus'
cask 'telegram'
cask 'telegram-desktop'
cask 'transmit'
cask 'tuple'
cask 'visual-studio-code'
cask 'vlc'

# fonts
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-code-nerd-font'

# app store
# mas 'Affinity Photo', id: 824183456
# mas 'Amphetamine', id: 937984704
# mas 'Dato', id: 1470584107
# mas 'GIPHY CAPTURE', id: 668208984
# mas 'Harvest', id: 506189836
# mas 'Parcel', id: 639968404
# mas 'Reeder', id: 1529448980
# mas 'The Unarchiver', id: 425424353
# mas 'Tweetbot', id: 1384080005
# mas 'Xcode', id: 497799835
# mas 'Contrast', id: 1254981365
