# frozen_string_literal: true

# taps
tap 'codeclimate/formulae'
tap 'dbcli/tap'
tap 'github/gh'
tap 'heroku/brew'
tap 'homebrew/cask-fonts'
tap 'bbc/audiowaveform'
tap 'jesseduffield/lazydocker'
tap 'hashicorp/tap'
tap 'homebrew-ffmpeg/ffmpeg'
tap 'buildpacks/tap'

# general tools
brew 'antibody'
# brew 'autojump' # zoxide instead!
brew 'awscli'
brew 'axel'
brew 'bash'
brew 'bat'
brew 'broot'
brew 'cabal-install'
brew 'codeclimate'
brew 'curl', args: ['with-nghttp2']
brew 'diff-so-fancy'
brew 'elixir'
brew 'exa'
brew 'exercism'
brew 'fd'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-interactive-rebase-tool'
brew 'git-lfs'
brew 'git-trim'
brew 'go'
brew 'haskell-stack'
brew 'heroku'
brew 'hugo'
brew 'httpie'
brew 'jq'
brew 'kibana'
brew 'jesseduffield/lazydocker/lazydocker'
brew 'magic-wormhole'
brew 'mas'
brew 'mosh'
brew 'neovim'
brew 'openssl'
brew 'overmind'
brew 'buildpacks/tap/pack'
brew 'pgcli'
brew 'plow'
brew 'postgresql'
brew 'procs'
brew 'pyenv'
brew 'rbenv'
brew 'redis'
brew 'shellcheck'
brew 'tealdeer' # tldr client
brew 'hashicorp/tap/terraform'
brew 'tig'
brew 'trash'
brew 'vim'
brew 'wget'
brew 'youtube-dl'
brew 'zoxide'
brew 'zsh'
brew 'zsh-completions'

# audio tools
brew 'audiowaveform'
brew 'taglib'
brew 'sox'
brew 'libopenmpt'
brew 'game-music-emu'
brew 'homebrew-ffmpeg/ffmpeg/ffmpeg', args: %w[with-libopenmpt with-game-music-emu]
brew 'libshout'

# casks
cask '1password'
cask 'alfred'
cask 'audacity'
cask 'chromedriver'
cask 'homebrew/cask/dash'
cask 'devutils'
cask 'discord'
cask 'homebrew/cask/docker'
cask 'dropbox'
cask 'elgato-control-center'
cask 'fig'
cask 'figma'
cask 'firefox'
cask 'fork'
cask 'github'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'handbrake'
cask 'hey'
cask 'homebrew/cask-versions/java8'
cask 'insomnia'
cask 'iterm2'
cask 'java'
cask 'karabiner-elements'
cask 'muzzle'
cask 'ngrok'
cask 'numi'
cask 'obsidian'
cask 'ocenaudio'
cask 'omnidisksweeper'
cask 'paw'
cask 'pictogram'
# cask 'pop'
# cask 'postman'
cask 'proxyman'
cask 'session-manager-plugin'
cask 'sequential'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'surfshark'
cask 'tableplus'
cask 'telegram'
cask 'transmit'
cask 'tuple'
cask 'visual-studio-code'
cask 'vlc'

# fonts
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-firacode-nerd-font'

# app store
mas 'Affinity Photo', id: 824183456
mas 'Amphetamine', id: 937984704
mas 'Dato', id: 1470584107
mas 'GIPHY CAPTURE', id: 668208984
mas 'Harvest', id: 506189836
mas 'Parcel', id: 639968404
mas 'Reeder', id: 1529448980
mas 'The Unarchiver', id: 425424353
mas 'Tweetbot', id: 1384080005
mas 'Xcode', id: 497799835
# mas 'Contrast', id: 1254981365
