# frozen_string_literal: true

# taps
tap 'codeclimate/formulae'
tap 'dbcli/tap'
tap 'github/gh'
tap 'heroku/brew'
tap 'homebrew/cask-fonts'
tap 'bbc/audiowaveform'
tap 'jesseduffield/lazydocker'
tap 'hashicorp/tap'

# general tools
brew 'antibody'
brew 'autojump'
brew 'awscli'
brew 'axel'
brew 'bash'
brew 'bat'
brew 'broot'
brew 'cabal-install'
brew 'codeclimate'
brew 'curl', args: ['with-nghttp2']
brew 'diff-so-fancy'
brew 'elasticsearch'
brew 'elixir'
brew 'exa'
brew 'exercism'
brew 'fd'
brew 'gh'
brew 'git'
brew 'git-lfs'
brew 'git-trim'
brew 'go'
brew 'gradle'
brew 'haskell-stack'
brew 'heroku'
brew 'hugo'
brew 'httpie'
brew 'git-interactive-rebase-tool'
brew 'jq'
brew 'kibana'
brew 'jesseduffield/lazydocker/lazydocker'
brew 'libshout'
brew 'logstash'
brew 'magic-wormhole'
brew 'mas'
brew 'mosh'
brew 'neovim'
brew 'openssl'
brew 'overmind'
brew 'postgresql'
brew 'pgcli'
brew 'pyenv'
brew 'rbenv'
brew 'redis'
brew 'shellcheck'
brew 'tealdeer' # tldr client
brew 'hashicorp/tap/terraform'
brew 'trash'
brew 'tig'
brew 'vim'
brew 'wget'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-completions'

# audio tools
brew 'audiowaveform'
brew 'taglib'
brew 'sox'

# casks
cask 'chromedriver'
cask 'java'
cask 'homebrew/cask-versions/java8'
cask 'ngrok'
cask 'fission'
cask 'handbrake'
cask 'numi'
cask 'proxyman'
cask 'paw'
cask 'insomnia'
cask 'muzzle'
cask 'ocenaudio'
cask 'hey'
cask 'softu2f'
cask 'keepingyouawake'

# fonts
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-firacode-nerd-font'

# app store
mas 'Contrast', id: 1254981365
# add everything i have installed
# especially xcode
